// Задача 56: Задайте прямоугольный двумерный массив. Напишите программу,
// которая будет находить строку с наименьшей суммой элементов.
// Например, задан массив:
// 1 4 7 2
// 5 9 2 3
// 8 4 2 4
// 5 2 6 7
// Программа считает сумму элементов в каждой строке и выдаёт
//  номер строки с наименьшей суммой элементов: 1 строка

Console.WriteLine("введите размер прямоугольного массива");
int size1 = int.Parse(Console.ReadLine());
int[,] massive = new int[size1, size1];
FillArray(massive);
PrintArray(massive);
Console.WriteLine();
DigitStringMinSumElements(massive);


// Функция вывода номера строки с наименьшей суммой элементов 
void DigitStringMinSumElements(int[,] array)
{
    int minString = 0;
    int minSumString= 0;
    int sumString = 0;
    for (int i = 0; i < massive.GetLength(1); i++)
    {
        minString += massive[0, i];
    }
    for (int i = 0; i < massive.GetLength(0); i++)
    {
        for (int j = 0; j < massive.GetLength(1); j++) sumString += massive[i, j];
        if (sumString < minString)
        {
            minString = sumString;
            minSumString = i;
        }
        sumString = 0;
    }
    Console.Write($"{minSumString + 1} строка");
}

// Функция печати двумерного массива
void PrintArray(int[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            Console.Write($"{array[i, j]} ");
        }
        Console.WriteLine();
    }
}

// Функция заполнения массива 
void FillArray(int[,] array)
{
    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            array[i, j] = new Random().Next(1, 10);
        }
    }
}
